_Rarzrabotki/BASEBuh/InformationRegisters/ИсключенныеИзПерепроведенияМесяцы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИсключенныеИзПерепроведенияМесяцы</Name>
			<Comment>Месяцы, за которые в обработке "Закрытие месяца" не будет выполняться перепроведение</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследовательности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПоследовательности</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Comment>Первое число месяца</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/BASEBuh/InformationRegisters/ИсключенныеИзПерепроведенияМесяцы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает Истина, если указанный месяц по указанной организации 
// содержится в регистре исключенных месяцев.
//
// Параметры:
//	- Организация - СправочникСсылка.Организация или массив со ссылками на справочник Организации
//	- ПериодРегистрации - дата
//
// Возвращаемое значение:
//	Булево
//
Функция МесяцИсключенИзПерепроведения(Организация, ПериодРегистрации) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсключенныеИзПерепроведенияМесяцы.Организация
	|ИЗ
	|	РегистрСведений.ИсключенныеИзПерепроведенияМесяцы КАК ИсключенныеИзПерепроведенияМесяцы
	|ГДЕ
	|	ИсключенныеИзПерепроведенияМесяцы.Организация В (&Организация)
	|	И ИсключенныеИзПерепроведенияМесяцы.ПериодРегистрации = &ПериодРегистрации
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

// Добавляет в регистр запись об исключении месяцев из перепроведения.
// 
// Параметры:
//	Организация - СправочникСсылка.Организации - организация, по которой добавляются записи.
//	ПериодРегистрации - Дата - первое числе месяца, для которого добавить записи в регистр,
//		
Процедура ДобавитьЗапись(Организация, ПериодРегистрации) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	МоментНарушения = РаботаСПоследовательностями.МоментНарушенияПоследовательности(
		Организация, , КонецМесяца(ПериодРегистрации));

	МенеджерЗаписиРегистра = РегистрыСведений.ИсключенныеИзПерепроведенияМесяцы.СоздатьМенеджерЗаписи();
	
	// Измерения
	МенеджерЗаписиРегистра.Организация 			= Организация;
	МенеджерЗаписиРегистра.ПериодРегистрации 	= НачалоМесяца(ПериодРегистрации);
	
	// Ресурсы - сохраним состояние последовательности, которое было на момент исключения из перепроведения.
	Если МоментНарушения <> Неопределено Тогда
		МенеджерЗаписиРегистра.ДатаПоследовательности 		= МоментНарушения.Дата;
		МенеджерЗаписиРегистра.ДокументПоследовательности 	= МоментНарушения.Ссылка;
	КонецЕсли;
	
	МенеджерЗаписиРегистра.Ответственный = Пользователи.ТекущийПользователь();
	МенеджерЗаписиРегистра.ДатаЗаписи	 = ТекущаяДатаСеанса();
	
	МенеджерЗаписиРегистра.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура УдалитьЗапись(Организация, ПериодРегистрации) Экспорт
			
	МенеджерЗаписиРегистра = РегистрыСведений.ИсключенныеИзПерепроведенияМесяцы.СоздатьМенеджерЗаписи();
	МенеджерЗаписиРегистра.Организация 			= Организация;
	МенеджерЗаписиРегистра.ПериодРегистрации    = НачалоМесяца(ПериодРегистрации);
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписиРегистра.Удалить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


#КонецЕсли
